init.el

(defun efs/run-in-background (command)
  (let ((command-parts (split-string command "[ ]+")))
    (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

(defun efs/set-wallpaper ()
  (interactive)
  ;; NOTE: You will need to update this to a valid background path!
  (start-process-shell-command
      "feh" nil  "feh --recursive --bg-fill --randomize ~/wallpapers/*"))

(defun efs/exwm-init-hook ()
  ;; Make workspace 1 be the one where we land at startup
  (exwm-workspace-switch-create 1)

  ;; Open eshell by default
  ;;(eshell)

  ;; Show battery status in the mode line
  (display-battery-mode 1)

  ;; Show the time and date in modeline
  (setq display-time-day-and-date t)
  (display-time-mode 1)
  ;; Also take a look at display-time-format and format-time-string

  ;; Launch apps that will run in the background
  (efs/run-in-background "nm-applet")
  (efs/run-in-background "pasystray")
  (efs/run-in-background "blueman-applet"))

(defun efs/exwm-update-class ()
  (exwm-workspace-rename-buffer exwm-class-name))

(defun efs/exwm-update-title ()
  (pcase exwm-class-name
    ("Firefox"      (exwm-workspace-rename-buffer (format exwm-title)))
    ("Firefox Beta" (exwm-workspace-rename-buffer (format exwm-title)))
    ("okular" (exwm-workspace-rename-buffer (format exwm-title)))
    ("Brave-browser"(exwm-workspace-rename-buffer (format exwm-title)))))

(defun restrict-fullscreen ()
  (interactive)
  (toggle-frame-fullscreen)
  (exwm-reset))

;; This function isn't currently used, only serves as an example how to
;; position a window
(defun efs/position-window ()
  (let* ((pos (frame-position))
         (pos-x (car pos))
         (pos-y (cdr pos)))

    (exwm-floating-move (- pos-x) (- pos-y))))

(defun efs/configure-window-by-class ()
  (interactive)
  (pcase exwm-class-name
    ("Sol" (exwm-workspace-move-window 3))
    ("mpv" ;;(exwm-floating-toggle-floating)
           (exwm-layout-toggle-mode-line))))


(defun open-terminal ()
  (interactive)
  (start-process-shell-command "terminator" nil "terminator"))
(use-package exwm
  :config
  ;; Set the default number of workspaces
  (setq exwm-workspace-number 10)

  ;; When window "class" updates, use it to set the buffer name
  (add-hook 'exwm-update-class-hook #'efs/exwm-update-class)

  ;; When window title updates, use it to set the buffer name
  (add-hook 'exwm-update-title-hook #'efs/exwm-update-title)

  ;; Configure windows as they're created
  (add-hook 'exwm-manage-finish-hook #'efs/configure-window-by-class)

  ;;Make char mode active
  (add-hook 'exwm-manage-finish-hook #'exwm-input-release-keyboard)

  ;; When EXWM starts up, do some extra confifuration
  (add-hook 'exwm-init-hook #'efs/exwm-init-hook)

  (add-hook 'exwm-manage-finish-hook
            (lambda ()
              (when (and exwm-class-name
                         (string= exwm-class-name "Terminator"))
                (exwm-input-set-local-simulation-keys '(([?\C-c ?\C-c] . ?\C-c))))))

  ;;keyboard layout is us or dvp
  (start-process-shell-command "setxkbmap" nil "setxkbmap -model 'pc104' -layout 'us(cmk_ed_us), us' -option 'misc:extend,lv5:caps_switch_lock,grp:shifts_toggle,compose:menu'")
  ;;(start-process-shell-command "setxkbmap" nil "setxkbmap -model pc104 -layout us -variant colemak")



  ;; Rebind Alt Car and Prt Scr to Ctrl
  (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")


  ;;Would  seet keyboard layout to dvorak
  ;;(start-process-shell-command "setxkbmap" nil "setxkbmap -model pc104 -layout us -variant dvorak")
  ;; NOTE: Uncomment the following two options if you want window buffers
  ;;       to be available on all workspaces!

  ;; Automatically move EXWM buffer to current workspace when selected
  (setq exwm-layout-show-all-buffers t)

  ;; Display all EXWM buffers in every workspace buffer list
  (setq exwm-workspace-show-all-buffers t)

  ;; NOTE: Uncomment this option if you want :w
  ;;to detach the minibuffer!
  ;; Detach the minibuffer (show it with exwm-workspace-toggle-minibuffer)
  ;;(setq exwm-workspace-minibuffer-position 'top)

  ;; Set the screen resolution (update this to be the correct resolution for your screen!)
  (require 'exwm-randr)
  (exwm-randr-enable)
  (start-process-shell-command "xrandr" nil "xrandr --output Virtual-1 --primary --mode 1920x1080x32 --pos 0x0 --rotate normal")

  ;; Set the wallpaper after changing the resolution
  (efs/set-wallpaper)

  ;; Load the system tray before exwm-init
  (require 'exwm-systemtray)
  (setq exwm-systemtray-height 32)
  ;;(exwm-systemtray-enable)

  ;;Launch picom on startup
  (start-process-shell-command "picom" nil "picom")
  ;; These keys should always pass through to Emacs
  (setq exwm-input-prefix-keys
    '(?\C-x
      ?\C-u
      ?\C-h
      ?\M-x
      ?\M-`
      ?\M-&
      ?\M-:
      ?\C-\M-j  ;; Buffer list
      ?\C-\ ))  ;; Ctrl+Space

  ;; Ctrl+Q will enable the next key to be sent directly
  (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

  ;; Set up global key bindings.  These always work, no matter the input state!
  ;; Keep in mind that changing this list after EXWM initializes has no effect.
  (setq exwm-input-global-keys
        `(
          ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)


          ([?\s-r] . exwm-reset)

          ;;Swaps Windows
          ([s-M-left] . windmove-swap-states-left)
          ([s-M-right] . windmove-swap-states-right)
          ([s-M-up] . windmove-swap-states-up)
          ([s-M-down] . windmove-swap-states-down)

          ;; Move between windows
          ([s-left] . windmove-left)
          ([s-right] . windmove-right)
          ([s-up] . windmove-up)
          ([s-down] . windmove-down)

          ;;VIM window control
          ;;Swaps Windows
          ([s-M-h] . windmove-swap-states-left)
          ([s-M-l] . windmove-swap-states-right)
          ([s-M-k] . windmove-swap-states-up)
          ([s-M-j] . windmove-swap-states-down)

          ;;Moves between windows
          ([?\s-h] . windmove-left)
          ([?\s-l] . windmove-right)
          ([?\s-k] . windmove-up)
          ([?\s-j] . windmove-down)



          ;;Log Out
          ([?\C-x ?\C-c] . save-buffer-kill-emacs)

          ;;Kills current buffer
          ([?\s-c] . kill-buffer)
          ;;Removes a Window
          ([?\s-q] . delete-window)
          ;;Kills current buffer and removes window
          ;;([?\s-Q] . kill-buffer-and-window)


          ;;Window Splitting

          ([?\s-y] . split-window-right)
          ([?\s-x] . split-window-below)

          ;; Launch applications via shell command
          ([?\s-.] . (lambda (command)
                       (interactive (list (read-shell-command "$ ")))
                       (start-process-shell-command command nil command)))

          ;; Switch workspace
          ([?\s-w] . exwm-workspace-switch)
          ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

          ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
          ,@(mapcar (lambda (i)
                      `(,(kbd (format "s-%d" i)) .
                        (lambda ()
                          (interactive)
                          (exwm-workspace-switch-create ,i))))
                    (number-sequence 0 9))))

  (exwm-input-set-key (kbd "s-SPC") 'counsel-linux-app)
  ;; Epic Volume aadjustment
  (exwm-input-set-key (kbd "s-[") 'desktop-environment-volume-decrement-slowly)
  (exwm-input-set-key (kbd "s-]") 'desktop-environment-volume-increment-slowly)
  (exwm-input-set-key (kbd "s-<return>") 'open-terminal)


  ;;Resize Windows  
  (exwm-input-set-key (kbd "s-C-h") 'exwm-layout-shrink-window-horizontally)
  (exwm-input-set-key (kbd "s-C-j") 'exwm-layout-shrink-window)
  (exwm-input-set-key (kbd "s-C-k") 'exwm-layout-enlarge-window)
  (exwm-input-set-key (kbd "s-C-l") 'exwm-layout-enlarge-window-horizontally)
  ;;Resize Windows  
  (exwm-input-set-key (kbd "s-M-h") 'windmove-swap-states-left)
  (exwm-input-set-key (kbd "s-M-j") 'windmove-swap-states-down)
  (exwm-input-set-key (kbd "s-M-k") 'windmove-swap-states-up)
  (exwm-input-set-key (kbd "s-M-l") 'windmove-swap-states-right)
  (exwm-enable))
