Emacs.org
** Set-up of other files
#+begin_src shell :tangle no
  sudo cp -f ~/.emacs.d/exwm/EXWM.desktop /usr/share/xsessions/EXWM.desktop
#+end_src

#+begin_src shell :tangle ./exwm/EXWM.desktop :mkdirp yes
  [Desktop Entry]
  Name=EXWM
  Comment=Emacs Window Manager
  Exec=sh /home/xenonex/.emacs.d/exwm/start-exwm.sh
  TryExec=sh
  Type=Application
  X-LightDM-DesktopName=exwm
  DesktopNames=exwm
#+end_src

#+begin_src shell :tangle ./exwm/start-exwm.sh :shebang #!/bin/sh
  # Set the screen DPI (uncomment this if needed!)
  # xrdb ~/.emacs.d/exwm/Xresources

  # Fire it up
  exec dbus-launch --exit-with-session emacs -mm --debug-init
#+end_src

#+begin_src shell :tangle ./exwm/Xmodmap
  clear control
  keycode 107 = Control_L
  keycode 108 = Control_L
  add control = Control_L
#+end_src

#+begin_src shell conf :tangle ./exwm/Xresources
  Xft.dpi: 100
#+end_src

** Desktop Environment
Set up desktop key bindings
#+begin_src emacs-lisp
(use-package desktop-environment
  :after exwm
  :custom
  (desktop-environment-brightness-small-increment "2%+")
  (desktop-environment-brightness-small-decrement "2%-")
  (desktop-environment-brightness-normal-increment "5%+")
  (desktop-environment-brightness-normal-decrement "5%-"))
#+end_src

